# *tips and tricks in pandas*
Written By: M. Ahmed Raza
Date: 22/7/2024

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [ ]:
# check lib version
pd.show_versions()

*1- Make a dataframe*

In [6]:
# make a dataframe
df = pd.DataFrame({'Year':[2011,2003,2005,2008,2007], 'Champion':["Vettel","Schumacher","Alonso","Hamilton","Raikkonen"]})
df

   Year    Champion
0  2011      Vettel
1  2003  Schumacher
2  2005      Alonso
3  2008    Hamilton
4  2007   Raikkonen

*2- Array using numpy then forming a dataset*

In [ ]:
# array using numpy then dataset
arr = np.array([[1,2,3],[3,4,5],[7,8,9]])
df = pd.DataFrame(arr)
df

*3- generate a rand array and rename its comlumns*

In [7]:
# way to generate a random array and name the columns ABC
df = pd.DataFrame(np.random.rand(3,3),columns=list("ABC"))

*4- Rename the columns*

In [ ]:
# renaming the columns
df = pd.DataFrame(np.random.rand(3,3),columns=list("ABC"))
df.rename(columns= {'A': 'col_1', 'B' : 'col_2', 'C': 'col_3'}, inplace= True)
df

*5- Replace a char in col name*

In [8]:
# replace a character( 'actual char', 'replaced char')
df.columns=df.columns.str.replace('_','-')
df

          A         B         C
0  0.639072  0.096460  0.828008
1  0.235530  0.317185  0.654012
2  0.494187  0.977635  0.460961

*6- Add suffix prefix in col name*

In [ ]:
# add prefix
# df.add_prefix('1.')
# add suffix
df.add_suffix('_1')

# *Using template dataframes*

In [ ]:
# names of datasets in sns
sns.get_dataset_names()

In [ ]:
# load dataset
df = sns.load_dataset('tips')

*7- Reverse row order*

In [4]:
# reverse row order
df.loc[::-1]
df.head()

NameError: name 'df' is not defined

In [ ]:
df.loc[::-1].reset_index(drop=True).head()
df

*8- Reverse col order*

In [ ]:
# reverse column order
df.loc[:, ::-1]
df.head()

*9- data types in dataset*

In [ ]:
# data types of dataset
df.dtypes

*10- Select col based on dtypes*

In [ ]:
# select columns based on datatype
df.select_dtypes(include=['float']).head()

 *11- exlcude col based on datatype*

In [1]:

df.select_dtypes(exclude=['number']).head()

NameError: name 'df' is not defined

*9- Type Casting*

In [9]:
df = pd.DataFrame({'A': [ 1, 2, 4], 'B' : [ 5, 6, 7]})
df.astype({'A': 'str', 'B': 'str'}).dtypes

A    object
B    object
dtype: object

*10 - Extract a sample from dataset*

In [27]:
dff = sns.load_dataset('tips')
dff.sample(frac=0.5).shape
# size of dataset
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

  *11- Copy data from clipboard*

In [23]:
df = sns.load_dataset('tips')
df.to_excel('kashti.xlsx')
dff = pd.read_clipboard()
dff

   Dinner
0  Dinner
1  Dinner
2  Dinner
3  Dinner
4  Dinner
5  Dinner
6  Dinner

  *12- Split dataframe into 2 sets*

In [ ]:
from random import random
tips_1 = df.sample(frac= 0.5, random_state=1)
# extracted a sample from dataset (50%) and of random values
tips_1

In [30]:
# drop/remove tips_1 values from original set to get 2nd set
tips_2 = df.drop(tips_1.index)
tips_2.shape

(122, 7)

In [31]:
# total is equal to orginal set
len(tips_1) + len(tips_2)

244

*13- Filerting a dataset*

In [ ]:
# all data of males 
df = sns.load_dataset('titanic')
df[(df.sex=="male")]

In [ ]:
# filter based on males AND embarked
df[(df.sex=="male") & (df.embarked== "S")]

*14- Filtering large categories*

In [ ]:
df = sns.load_dataset('titanic')
# how many male female 
# nlargest tells us the freq of each unique value
#nlargest for all values and nlargest(2) for top 2 
dff = df.age.value_counts().nlargest()
dff

*15- Splitting a string to multiple columns*

In [ ]:
df = pd.DataFrame({'name': ['Ahmed Raza', 'Maryam Khan', 'Abdullah Khan'],
                    'Location': ['New York','London','New Jersey']})

In [ ]:
# once seperated add col first_name and last_name
df[['first_name', 'last_name']] = df.name.str.split(' ', expand=True)
# include only these 3 col
df = df[['first_name','last_name','Location']]
df

*16- Aggregate my multiple groups*

In [16]:
df = sns.load_dataset('titanic')
df.groupby('sex').count()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,314,314,261,314,314,314,312,314,314,314,97,312,314,314
male,577,577,453,577,577,577,577,577,577,577,106,577,577,577

In [25]:
df.groupby('who').count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

In [27]:
# check num of variables in a col
dff = len(df.groupby('sex'))
dff 
# answer is 2 because there are 2 sex

2

In [28]:
df.groupby(['sex','pclass']).count()

               survived  age  sibsp  parch  fare  embarked  class  who  \
sex    pclass
female 1             94   85     94     94    94        92     94   94
       2             76   74     76     76    76        76     76   76
       3            144  102    144    144   144       144    144  144
male   1            122  101    122    122   122       122    122  122
       2            108   99    108    108   108       108    108  108
       3            347  253    347    347   347       347    347  347

               adult_male  deck  embark_town  alive  alone
sex    pclass
female 1               94    81           92     94     94
       2               76    10           76     76     76
       3              144     6          144    144    144
male   1              122    94          122    122    122
       2              108     6          108    108    108
       3              347     6          347    347    347

*17- Select specific rows col*

In [30]:
# select col
df = sns.load_dataset('titanic')
df[['sex','embarked']]

        sex embarked
0      male        S
1    female        C
2    female        S
3    female        S
4      male        S
..      ...      ...
886    male        S
887  female        S
888  female        S
889    male        C
890    male        Q

[891 rows x 2 columns]

In [ ]:
# select only min max rows
df.describe().loc[['min','max']]

In [ ]:
# one row to another and every row in between
df.describe().loc['min':'max']

*18- Reshape multiindex*

In [ ]:
df.groupby(['pclass','sex','embarked']).survived.mean()

*19- Continious to categorical data*

In [ ]:
df.age.head()

In [ ]:
# creating bins
# people from 0 to 18 child, 18 to 25 young, 25 to 99 adult
pd.cut(df.age, bins=[0,18,25,99], labels=['child','young','adult'])
# created a new col and added it to dataset
df['new_age'] = pd.cut(df.age, bins=[0,18,25,99], labels=['child','young','adult'])
df.head()

*20- Convert one set of values to another*

In [ ]:

mapping = df.sex.map({'male': 0, 'female':1})
df['sex_num'] = mapping
df.head()

In [ ]:
# a new col and each new value gets a num eg C= 0, S= 1, N=2....
# 0 is starting num as we get new values new nums are given to that value
df['embarked_num'] = df.embarked.factorize()[0]
df.head(15)

*21- Transpose a wide dataset*

In [ ]:
df = pd.DataFrame({'Nums': ['1','2','3','4','5','6','7'],'Alpha': ['A','B','C','D','E','F','G']})
df.T

*22- Reshaping a dataframe*